# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd
from pandas import pivot_table

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# enter your code here
orders = pd.read_csv("../../lab-subsetting-and-descriptive-stats/your-code/Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [3]:
# your code here for Sub Problem 1

spent_by_customer = pivot_table(orders,index=['CustomerID','Country'], aggfunc={'amount_spent': sum})

spent_by_customer = spent_by_customer.sort_values('amount_spent',ascending=False)

spent_by_customer.head(10)

                           amount_spent
CustomerID Country
14646      Netherlands        280206.02
18102      United Kingdom     259657.30
17450      United Kingdom     194550.79
16446      United Kingdom     168472.50
14911      EIRE               143825.06
12415      Australia          124914.53
14156      EIRE               117379.63
17511      United Kingdom      91062.38
16029      United Kingdom      81024.84
12346      United Kingdom      77183.60

In [47]:
# your code here for Sub Problem 3

#calculate the limits regarding quantiles
vip_limit = spent_by_customer.quantile(0.95)[0]
print("Limit for VIP customers:",vip_limit)

preferred_limit = spent_by_customer.quantile(0.75)[0]
print("Limit for PREFERRED customer:",preferred_limit)

#select customer by its group
vip_customers = spent_by_customer[spent_by_customer['amount_spent'] > vip_limit]

vip_customers['VIP'] = True #labeling the VIP customer

print("\nTable of VIP customers")
vip_customers.head(10)

Limit for VIP customers: 5774.277999999997
Limit for PREFERRED customer: 1661.1950000000002

Table of VIP customers

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  del sys.path[0]

                           amount_spent   VIP
CustomerID Country
14646      Netherlands        280206.02  True
18102      United Kingdom     259657.30  True
17450      United Kingdom     194550.79  True
16446      United Kingdom     168472.50  True
14911      EIRE               143825.06  True
12415      Australia          124914.53  True
14156      EIRE               117379.63  True
17511      United Kingdom      91062.38  True
16029      United Kingdom      81024.84  True
12346      United Kingdom      77183.60  True

In [52]:
#select customer by its group
preferred_customers = spent_by_customer[(spent_by_customer.amount_spent <= vip_limit) & (spent_by_customer.amount_spent > preferred_limit)]

preferred_customers['Preferred'] = True
print("\nTable of PREFERRED customers")
preferred_customers.head(10)

Table of PREFERRED customers

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

                           amount_spent  Preferred
CustomerID Country
15218      United Kingdom       5756.89       True
17686      United Kingdom       5739.46       True
13178      United Kingdom       5725.47       True
16553      United Kingdom       5719.82       True
13468      United Kingdom       5704.97       True
14110      United Kingdom       5683.15       True
14049      United Kingdom       5681.72       True
17049      United Kingdom       5659.98       True
17716      United Kingdom       5655.99       True
13004      United Kingdom       5655.91       True

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [29]:
# your code here for Q2
vip_customers.reset_index(inplace=True)

country_by_vips = pivot_table(vip_customers, index=['Country'], aggfunc={'Country': len})

country_by_vips[country_by_vips['Country'] == country_by_vips['Country'].max()]

                Country
Country
United Kingdom      178

In [53]:
preferred_customers.reset_index(inplace=True)
preferred_customers.head()

   CustomerID         Country  amount_spent  Preferred
0       15218  United Kingdom       5756.89       True
1       17686  United Kingdom       5739.46       True
2       13178  United Kingdom       5725.47       True
3       16553  United Kingdom       5719.82       True
4       13468  United Kingdom       5704.97       True

In [54]:
vip_customers.reset_index(inplace=True)
vip_customers.head()

   CustomerID         Country  amount_spent   VIP
0       14646     Netherlands     280206.02  True
1       18102  United Kingdom     259657.30  True
2       17450  United Kingdom     194550.79  True
3       16446  United Kingdom     168472.50  True
4       14911            EIRE     143825.06  True

In [55]:
# your code here for Q3
high_customers = pd.concat([vip_customers,preferred_customers])

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

            Country  CustomerID Preferred   VIP  amount_spent
0       Netherlands       14646       NaN  True     280206.02
1    United Kingdom       18102       NaN  True     259657.30
2    United Kingdom       17450       NaN  True     194550.79
3    United Kingdom       16446       NaN  True     168472.50
4              EIRE       14911       NaN  True     143825.06
5         Australia       12415       NaN  True     124914.53
6              EIRE       14156       NaN  True     117379.63
7    United Kingdom       17511       NaN  True      91062.38
8    United Kingdom       16029       NaN  True      81024.84
9    United Kingdom       12346       NaN  True      77183.60
10   United Kingdom       16684       NaN  True      66653.56
11   United Kingdom       14096       NaN  True      65164.79
12   United Kingdom       13694       NaN  True      65039.62
13   United Kingdom       15311       NaN  True      60767.90
14   United Kingdom       13089       NaN  True      58825.83
15   United Kingdom       17949       NaN  True      58510.48
16   United Kingdom       15769       NaN  True      56252.72
17   United Kingdom       15061       NaN  True      54534.14
18   United Kingdom       14298       NaN  True      51527.30
19   United Kingdom       14088       NaN  True      50491.81
20   United Kingdom       15749       NaN  True      44534.30
21   United Kingdom       12931       NaN  True      42055.96
22   United Kingdom       17841       NaN  True      40991.57
23   United Kingdom       15098       NaN  True      39916.50
24   United Kingdom       13798       NaN  True      37153.85
25   United Kingdom       16013       NaN  True      37130.60
26   United Kingdom       16422       NaN  True      34684.40
27   United Kingdom       12748       NaN  True      33719.73
28   United Kingdom       15838       NaN  True      33643.08
29           Sweden       17404       NaN  True      31906.82
..              ...         ...       ...   ...           ...
839  United Kingdom       15240      True   NaN       1706.57
840  United Kingdom       16398      True   NaN       1705.80
841  United Kingdom       17282      True   NaN       1703.41
842  United Kingdom       12843      True   NaN       1702.26
843  United Kingdom       16007      True   NaN       1701.94
844  United Kingdom       13184      True   NaN       1701.29
845  United Kingdom       17193      True   NaN       1699.30
846  United Kingdom       13824      True   NaN       1698.94
847          Cyprus       12455      True   NaN       1698.90
848  United Kingdom       16775      True   NaN       1695.66
849         Lebanon       12764      True   NaN       1693.88
850  United Kingdom       14245      True   NaN       1693.45
851  United Kingdom       15549      True   NaN       1693.26
852  United Kingdom       16813      True   NaN       1692.98
853  United Kingdom       16671      True   NaN       1692.27
854  United Kingdom       15380      True   NaN       1690.26
855  United Kingdom       17152      True   NaN       1689.50
856         Germany       12635      True   NaN       1689.18
857  United Kingdom       13162      True   NaN       1688.29
858  United Kingdom       13577      True   NaN       1687.60
859  United Kingdom       16638      True   NaN       1680.72
860  United Kingdom       13647      True   NaN       1678.12
861  United Kingdom       13149      True   NaN       1676.06
862  United Kingdom       17656      True   NaN       1674.69
863  United Kingdom       16115      True   NaN       1667.97
864  United Kingdom       12912      True   NaN       1662.30
865         Germany       12530      True   NaN       1662.28
866  United Kingdom       13012      True   NaN       1661.84
867  United Kingdom       15214      True   NaN       1661.44
868  United Kingdom       15024      True   NaN       1661.33

[1087 rows x 5 columns]

In [58]:
high_customers.fillna(0,inplace=True)
calculus_high_customers = pivot_table(high_customers, index=['Country'], aggfunc={'VIP': len, 'Preferred': len} )
calculus_high_customers = calculus_high_customers[(calculus_high_customers.VIP + calculus_high_customers.Preferred)]
calculus_high_customers

KeyError: "None of [Int64Index([   8,    2,   22,    2,    8,    6,    6,    6,   10,   58,   78,\n               2,    2,    4,   10,    8,    2,    2,    2,   14,    2,   14,\n               2,   14,    4,   18, 1868],\n           dtype='int64')] are in the [columns]"